Revit 2024 API
ExternalDataInstanceAddedIntoDocumentEventArgs.ItemId Property
 The id of the external data item to which a new reference has been added.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public string ItemId { get; }
Visual Basic
Public ReadOnly Property ItemId As String
	Get
Visual C++
public:
property String^ ItemId {
	String^ get ();
}
See Also
ExternalDataInstanceAddedIntoDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace